Show / Hide Table of Contents
Enum MessageNumber
Message numbers
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
[Flags]
[DataContract]
public enum MessageNumber
Fields
 Name |  Description
 ErrBoltsTooClose
 ErrBoltsTooCloseEdge
 ErrContactsAngle
 ErrCurveDecreaseFunction
 ErrCurveDerivation
 ErrCurveFunction
 ErrCurveNotSet
 ErrCurveZeroPoint
 ErrDataObjectNotCreated
 ErrIncorrectMaterialEGP
 ErrIncorrentMaterialE
 ErrNoCrossSectionParameter
 ErrNoEquivalentObjectInDataModel
 ErrNoInLibrary
 ErrNoObjectInOpenModel
 ErrNoOpenObject
 ErrNoReferenceObjectInOpenModel
 Error
 ErrPreloadedBoltGrade
 ErrTimeout
 ErrValidPolyline
 ErrValueOutOfRange
 ErrWarningLoad
 Information
 Reserved
 Unspecified
 WarnCurveCount
 Warning
 WarnNoPropertyInData
 WarnReinforcementBarsCollision
 WarnValueOutOfRange
 Improve this Doc
 View Source